Table of Contents
 Enum ResultType
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Type of results
[Obfuscation(Feature = "renaming")]
public enum ResultType
Fields
CrossSectionMesh = 5
Mesh on cross-section
CrossSectionNLA = 2
NLA on cross-section
CrossSectionTA = 3
TA on cross-section
Deformation = 1
Deformation
InteractionDiagram = 4
Interaction digaram on section
InternalForces = 0
Internal forces
Fields
 Name |  Description
 CrossSectionMesh = 5
Mesh on cross-section
 CrossSectionNLA = 2
NLA on cross-section
 CrossSectionTA = 3
TA on cross-section
 Deformation = 1
Deformation
 InteractionDiagram = 4
Interaction digaram on section
 InternalForces = 0
Internal forces
 Edit this page